       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAPITULO-8.
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 NUMERO1 PIC 99 VALUE 15.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY NUMERO1
            STOP RUN.
       END PROGRAM CAPITULO-8.
